fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//++ a.demeshchenko 01.02.2025 netology Дипломный проект
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда		
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаНачала) Тогда
			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""",
				Метаданные.Справочники.ДоговорыКонтрагентов.Реквизиты.ВКМ_ДатаНачала.Заголовок.Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаНачала", "Объект.ВКМ_ДатаНачала", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаОкончания) Тогда
			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""",
				Метаданные.Справочники.ДоговорыКонтрагентов.Реквизиты.ВКМ_ДатаОкончания.Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаОкончания", "Объект.ВКМ_ДатаОкончания",
				Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СуммаАбонентскойПлаты) Тогда
			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""",
				Метаданные.Справочники.ДоговорыКонтрагентов.Реквизиты.ВКМ_СуммаАбонентскойПлаты.Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "СуммаАбонентскойПлаты",
				"Объект.ВКМ_СуммаАбонентскойПлаты", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВКМ_СтоимостьЧасаРаботыСпециалиста) Тогда
			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""",
				Метаданные.Справочники.ДоговорыКонтрагентов.Реквизиты.ВКМ_СтоимостьЧасаРаботыСпециалиста.Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "СтоимостьЧасаРаботыСпециалиста",
				"Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	//-- a.demeshchenko 01.02.2025 netology Дипломный проект	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
